# dict  字典
# 字典是一种没有顺序组合数据，数据以键值对的形式出现

# 创建字典
# dist={}
# dist = dict()
# dist ={"2":2,"3":3,"4":4}
# dist = dict(ds=2, dSD=3, KFD=4)
# dist = dict({"2":2,"3":3,"4":4})
# dist = dict(("2",2),("3",3),("4",4))

# 字典的特性
# 字典无序序列，因此无法进行分片和索引
# key 必须是可hash的

# 取值方式 dist[]  括号里是键

# 成员检测  in： 检测的是键

# str(dict) 返回字典的字符串格式

# items:返回字典的键值对组成的元组格式
# keys:返回字典键组成的可迭代结构
# values:返回字典值组成的可迭代结构
# get 获取值，如果没找到，返回None，不会抛异常，并可设置默认值
# dist = {"2": 2, "3": 3, "4": 4}

# fromkeys:使用指定的序列作为键，使用一个值作为字典所有键的值
l = [3, 5, 6, 7]
di = dict.fromkeys(l, "wo")
print(str(di))
